//
//  Names.swift
//  D&D Player's Character
//
//  Created by Евгений Полюбин on 02.05.2021.
//

import Foundation

struct PopularNames {
    var dwarfMenNames = "Адрик, Альберих, Баэрн, Барендд, Броттор, Бренор, Даин, Даррак, Делг, Эберк, Эйнкиль, Фаргрим, Флинт, Гардаин, Харбек, Килдрак, Моргран, Орсик, Оскар, Рангрим, Рюрик, Таклинн, Торадин, Торин, Тордек, Траубон, Травок, Ульфгар, Вэйт, Вондал."
    var dwarfWomensNames = "Эмбер, Артин, Одхильд, Бардрин, Дагнал, Диеза, Эльдет, Фалкрунн, Финеллен, Гуннлода, Гурдис, Хельджа, Хлин, Катра, Кристид, Илде, Лифтраса, Мардред, Рисвин, Саннл, Торбера, Торгга, Вистра."
    var dwarfClansNames = "Балдерк, Батлхаммер, Бронэнвил, Данкил, Фаерфордж, Фростбэрд, Горунн, Холдерхек, Айронфист, Лодерр, Лютгер, Рамнахейм, Стракелн, Торунн, Унгар."
}
