//
//  VehicleAndMount.swift
//  D&D Player's Character
//
//  Created by Евгений Полюбин on 15.06.2021.
//

import Foundation
//        1) Создать два класса Mount и Vehicle с суперклассом Item. Как должна в целом выглядеть иерархия в файле Armor
//        2) Создать отдельные классы для каждого существа и средства с соответсвующим суперклассом на стр 157 англ книга.
//        3) Создать протокол Transport и подписать под него все классы способные к транспортировке.
//        4) Так же создать протокол Riding и подписать под него каждое тягучее животное.
//        5) Создать класс TransportStaff c cупером Item
//        6) Создать классы для каждого предмета на стр 157, при необходимости создать вложенные перечисления.
        
    
